def draw_hangman(lang, current_lives=-1, total_lives=7):
    """Outputs ASCII art of hangman.
    lang = language;
    n - total num of lives;
    lives - current num of lives (leave empty when user won),
    """
    if lang == "eng":
        print(hangman_eng[total_lives - current_lives])
    else:
        print(hangman_rus[total_lives - current_lives])
        
hangman_eng = (
"""
   _________
    |/        
    |              
    |                
    |                 
    |               
    |                   
    |___                 
    """,

"""
   _________
    |/   |      
    |              
    |                
    |                 
    |               
    |                   
    |___                 
    H""",

"""
   _________       
    |/   |              
    |   (_)
    |                         
    |                       
    |                         
    |                          
    |___                       
    HA""",

"""
   ________               
    |/   |                   
    |   (_)                  
    |    |                     
    |    |                    
    |                           
    |                            
    |___                    
    HAN""",


"""
   _________             
    |/   |               
    |   (_)                   
    |   /|                     
    |    |                    
    |                        
    |                          
    |___                          
    HANG""",


"""
   _________              
    |/   |                     
    |   (_)                     
    |   /|\                    
    |    |                       
    |                             
    |                            
    |___                          
    HANGM""",



"""
   ________                   
    |/   |                         
    |   (_)                      
    |   /|\                             
    |    |                          
    |   /                            
    |                                  
    |___                              
    HANGMA""",


"""
   ________
    |/   |     
    |   (_)    
    |   /|\           
    |    |        
    |   / \        
    |               
    |___           
    HANGMAN""",

    
    """
   ________
    |/   |     
    |       
    |             
    |    \(_)/     
    |      |     
    |      |          
    |___  / \           
    SURVIVOR""")


hangman_rus = (
"""
   _________
    |/        
    |              
    |                
    |                 
    |               
    |                   
    |___                 
    В""",

"""
   _________
    |/   |      
    |              
    |                
    |                 
    |               
    |                   
    |___                 
    ВИ""",

"""
   _________       
    |/   |              
    |   (_)
    |                         
    |                       
    |                         
    |                          
    |___                       
    ВИС""",

"""
   ________               
    |/   |                   
    |   (_)                  
    |    |                     
    |    |                    
    |                           
    |                            
    |___                    
    ВИСЕ""",


"""
   _________             
    |/   |               
    |   (_)                   
    |   /|                     
    |    |                    
    |                        
    |                          
    |___                          
    ВИСЕЛ""",


"""
   _________              
    |/   |                     
    |   (_)                     
    |   /|\                    
    |    |                       
    |                             
    |                            
    |___                          
    ВИСЕЛЕ""",



"""
   ________                   
    |/   |                         
    |   (_)                      
    |   /|\                             
    |    |                          
    |   /                            
    |                                  
    |___                              
    ВИСЕЛИЦ""",


"""
   ________
    |/   |     
    |   (_)    
    |   /|\           
    |    |        
    |   / \        
    |               
    |___           
    ВИСЕЛИЦА""",

    
    """
   ________
    |/   |     
    |       
    |             
    |    \(_)/     
    |      |     
    |      |          
    |___  / \           
    ТЫ ВЫЖИЛ!""")
